
parking_lot = [
    ["🚗", "🅿️", "🅿️", "🚗", "🅿️", "🚗", "🅿️", "🅿️", "🚗", "🅿️"],
    ["🅿️", "🅿️", "🚗", "🅿️", "🚗", "🚗", "🅿️", "🅿️", "🅿️", "🚗"],
    ["🚗", "🅿️", "🚗", "🅿️", "🅿️", "🅿️", "🚗", "🅿️", "🅿️", "🅿️"],
    ["🅿️", "🚗", "🅿️", "🚗", "🚗", "🅿️", "🅿️", "🅿️", "🅿️", "🚗"],
    ["🅿️", "🅿️", "🚗", "🚗", "🅿️", "🅿️", "🚗", "🅿️", "🚗", "🅿️"],
    ["🅿️", "🅿️", "🅿️", "🅿️", "🚗", "🅿️", "🚗", "🚗", "🅿️", "🅿️"],
    ["🅿️", "🚗", "🅿️", "🅿️", "🅿️", "🚗", "🅿️", "🚗", "🅿️", "🅿️"],
    ["🚗", "🅿️", "🅿️", "🅿️", "🅿️", "🅿️", "🚗", "🅿️", "🚗", "🚗"],
    ["🅿️", "🚗", "🚗", "🅿️", "🅿️", "🚗", "🅿️", "🅿️", "🅿️", "🅿️"],
    ["🅿️", "🅿️", "🅿️", "🚗", "🅿️", "🚗", "🅿️", "🅿️", "🚗", "🅿️"]
]

if parking_lot[0][1] == "🅿️":
    print("주차 가능")
    print("dddd")


# 처음 실행할 때 주차장 만들고 초기화 작업
FLOORS = 10   # 층
COLS = 5      # 가로
ROWS = 3      # 세로

EMPTY = "🅿️"
CAR = "🚗"

def make_parking():
    parking = {}
    # 층 만들기
    for f in range(1, FLOORS+1):
        f_name = str(f) + "f"
        # 층 이름
        f_map = {} # 층 딕셔너리

        for r in range(1, ROWS+1):
            # 세로줄 만들기
            for c in range(1, COLS+1):
                # 가로줄 마늗릭
                if r == 2:   # 통로
                    f_map[(r,c)] = " "
                else:        # 주차 가능 자리
                    f_map[(r,c)] = EMPTY

        parking[f_name] = f_map
    return parking
